Caliton/folloup-sticky/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Waveshare ESP32-S3-ePaper-3.97 (ESP32-S3-WROOM-1-N16R8): 8 MB octal PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304

# Waveshare board: 16 MB QIO flash.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# OTA-ready custom flash layout (16 MB).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Audio: ES8311 codec over the esp_codec_dev / esp_audio_codec managed components.
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n

# USB mass storage (OTG) exposes the SD card, per the board's USB-OTG storage mode.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# Auto-sleep demo defaults for hardware validation.
CONFIG_FOLLOWUP_AUTO_SLEEP_DISPLAY_SLEEP_TIMEOUT_SECONDS=180
CONFIG_FOLLOWUP_AUTO_SLEEP_LIGHT_SLEEP_TIMEOUT_SECONDS=1800

# Wi-Fi and clock-sync demo defaults. Runtime NVS settings take precedence over
# these built-in station credentials.
CONFIG_FOLLOWUP_WIFI_AP_PREFIX="Followup"
CONFIG_FOLLOWUP_WIFI_STA_SSID=""
CONFIG_FOLLOWUP_WIFI_STA_PASSWORD=""
CONFIG_FOLLOWUP_WIFI_START_IN_AP_MODE=n
CONFIG_FOLLOWUP_TIME_SYNC_DEFAULT_ENABLED=y
CONFIG_FOLLOWUP_DEFAULT_TIMEZONE_NAME="America_Sao_Paulo"
CONFIG_FOLLOWUP_GEMINI_API_KEY=""

# SD card (SDMMC) long-filename support.
CONFIG_FATFS_LFN_NONE=n
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_LFN_STACK=n
CONFIG_FATFS_USE_LABEL=y

# Internal-RAM relief: without these, task creation runs out of internal heap
# at boot (InputCallbackDispatcher ESP_ERR_NO_MEM -> reboot loop).
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=n
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# Release build: -O2 speeds up mbedTLS handshakes and UI rendering over the -Og default.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# The Wi-Fi IP-event handler persists credentials to NVS on the default event task;
# 2304 bytes leaves little headroom for that path.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
# Lets main.cpp's heap report list every task's stack high-water mark.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
# Internal RAM is ~20 KB free after boot. Fewer static RX buffers (1.6 KB each, always
# resident) and a lower dynamic-RX ceiling bound Wi-Fi's share; throughput needs here are
# small (HTTPS to Gemini, NTP).
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
# Book file names on the SD card often carry accents; use UTF-8 for the FATFS API so
# "Memórias Póstumas.epub" opens instead of failing on an OEM code page.
CONFIG_FATFS_API_ENCODING_UTF_8=y
